import numpy as np
import matplotlib.pyplot as plt
from scipy.cluster.hierarchy import dendrogram, linkage
from scipy.spatial.distance import squareform

labels = ['К-2233', 'К-2699', 'К-2776', 'К-3110', 'К-3384', 'К-3599', 'К-3675', 'К-3714']

# FA SN-123
# distance_matrix = np.array([
#     [0, 0.1, 0.1, 0.8, 0.3, 0.9, 0.2, 0.2], # К-2233
#     [0.1, 0, 0.1, 1, 0.2, 1, 0.1, 0.1], # К-2699
#     [0.1, 0.1, 0, 0.9, 0.2, 0.9, 0.2, 0.2], # К-2776
#     [0.8, 1, 0.9, 0, 1.1, 0.1, 1, 1], # К-3110
#     [0.3, 0.2, 0.2, 1.1, 0, 1.1, 0.1, 0.1], # К-3384
#     [0.9, 1, 0.9, 0.1, 1.1, 0, 1.1, 1], # К-3599
#     [0.2, 0.1, 0.2, 1, 0.1, 1.1, 0, 0], # К-3675
#     [0.2, 0.1, 0.2, 1, 0.1, 1, 0, 0]  # К-3714
# ])
# FA SN-2
distance_matrix = np.array([
    [0, 0.2, 0.2, 1, 0.5, 1, 0.3, 0.3], # К-2233
    [0.2, 0, 0.1, 1.2, 0.2, 1.2, 0.1, 0.1], # К-2699
    [0.2, 0.1, 0, 1.1, 0.3, 1.1, 0.2, 0.2], # К-2776
    [1, 1.2, 1.1, 0, 1.4, 0, 1.3, 1.3], # К-3110
    [0.5, 0.2, 0.3, 1.4, 0, 1.4, 0.1, 0.1], # К-3384
    [1, 1.2, 1.1, 0, 1.4, 0, 1.3, 1.3], # К-3599
    [0.3, 0.1, 0.2, 1.3, 0.1, 1.3, 0, 0], # К-3675
    [0.3, 0.1, 0.2, 1.3, 0.1, 1.3, 0, 0]  # К-3714
])
# TAG
# distance_matrix = np.array([
#     [0.0, 0.3, 0.2, 1.5, 0.6, 1.5, 0.4, 0.4], # К-2233
#     [0.3, 0.0, 0.2, 1.7, 0.3, 1.6, 0.2, 0.2], # К-2699
#     [0.2, 0.2, 0.0, 1.6, 0.4, 1.6, 0.3, 0.3], # К-2776
#     [1.5, 1.7, 1.6, 0.0, 1.8, 0.3, 1.7, 1.7], # К-3110
#     [0.6, 0.3, 0.4, 1.8, 0.0, 1.7, 0.2, 0.2], # К-3384
#     [1.5, 1.6, 1.6, 0.3, 1.7, 0.0, 1.7, 1.7], # К-3599
#     [0.4, 0.2, 0.3, 1.7, 0.2, 1.7, 0.0, 0.1], # К-3675
#     [0.4, 0.2, 0.3, 1.7, 0.2, 1.7, 0.1, 0.0]  # К-3714
# ])

# 2. Преобразование в конденсированную форму (требуется для linkage)
condensed_dist = squareform(distance_matrix)

# 3. Иерархическая кластеризация (метод Уорда минимизирует дисперсию внутри кластеров)
# Можно также использовать method='average' или 'single'
Z = linkage(condensed_dist, method='ward')

# 4. Построение дендрограммы
plt.figure(figsize=(10, 6))
dendrogram(
    Z,
    labels=labels,
    leaf_rotation=0,    # Поворот подписей
    leaf_font_size=24,  # Размер шрифта
    color_threshold=0.4 # Порог для раскраски кластеров (визуально подобран под ваши данные)
)

# plt.title('Дендрограмма кластеризации образцов (Жирные кислоты SN-1,2,3)', fontsize=18)
# plt.title('Дендрограмма кластеризации образцов (Жирные кислоты SN-2)', fontsize=14)
# plt.title('Дендрограмма кластеризация образцов (ТАГ)', fontsize=14)
plt.xlabel('Образцы', fontsize=18)
plt.ylabel('Манхэттенское расстояние, Ward', fontsize=18)
plt.tick_params(axis='y', which='major', labelsize=24)
plt.grid(axis='y', linestyle='--', alpha=0.7)
plt.tight_layout()
plt.show()
